README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-08-24 Fri 20:08 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>cc-dcm2bids.py</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Jan Nikadon" />
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">cc-dcm2bids.py</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org86b8b4e">1. <span class="todo TODO">TODO</span> TODOs</a></li>
<li><a href="#orgdec8cfa">2. Info</a></li>
<li><a href="#org7b4ec12">3. Dependencies</a></li>
<li><a href="#org50db635">4. Help</a></li>
<li><a href="#orgb26b069">5. Example of functional sequences inspection (GE MR750)</a>
<ul>
<li><a href="#orgad85907">5.1. Overview</a>
<ul>
<li><a href="#orgd2d5439">5.1.1. Code</a></li>
<li><a href="#org5c46414">5.1.2. Info</a></li>
<li><a href="#orga961d3e">5.1.3. Standard tree</a></li>
<li><a href="#orgcf52518">5.1.4. Detailed tree</a></li>
<li><a href="#org61edb0b">5.1.5. Table</a></li>
<li><a href="#org68883af">5.1.6. fMRI geometry</a></li>
</ul>
</li>
<li><a href="#org7d7a9a0">5.2. fMRI geometry</a>
<ul>
<li><a href="#orga299f1f">5.2.1. Script</a></li>
<li><a href="#org8611d0f">5.2.2. Results</a></li>
<li><a href="#org8ab3fa1">5.2.3. Links and notes</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org86b8b4e" class="outline-2">
<h2 id="org86b8b4e"><span class="section-number-2">1</span> <span class="todo TODO">TODO</span> TODOs</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> add <b>slice timing estimation</b> functionality based on <code>TR</code> and slice position/time</li>
<li class="on"><code>[X]</code> use the first 256 (or actually ~44) slices only (do not load whole series data)
<ul class="org-ul">
<li class="on"><code>[X]</code> make example (dummy) EPI acquisitions for:
<ul class="org-ul">
<li class="on"><code>[X]</code> sequential top/down (<code>sTD</code>)</li>
<li class="on"><code>[X]</code> sequential bottom/up (<code>sBU</code>)</li>
<li class="on"><code>[X]</code> interleaved top/down (<code>iTD</code>)</li>
<li class="on"><code>[X]</code> interleaved bottom-up (<code>iBU</code>)</li>
</ul></li>
<li class="on"><code>[X]</code> test the above mentioned code against the above mentioned data</li>
</ul></li>
<li class="on"><code>[X]</code> add <code>-v</code>, <code>-vv</code>, <code>-vvv</code> for increased verbosity instead of <code>-m</code> for messages (but keep the debug mode <code>-d</code>) possibly combine <code>-vvv</code> and <code>-d</code> (or provide <code>-dd</code> <code>-ddd</code>)</li>
<li class="off"><code>[&#xa0;]</code> re-think the <i>"Origin"</i> (as it was in the previous version resulting in <code>./</code> being added at sthe beginning of each of relative paths)</li>
<li class="off"><code>[&#xa0;]</code> add files counter (for logging and printing)</li>
<li class="off"><code>[&#xa0;]</code> add checking if <code>*</code> is present at least (or exactly) once in each pattern (for patient, exam, series, files)</li>
<li class="off"><code>[&#xa0;]</code> consider checking if at any level at least one directoty/file exists (otherwise raise an error)</li>
</ul>
</div>
</div>

<div id="outline-container-orgdec8cfa" class="outline-2">
<h2 id="orgdec8cfa"><span class="section-number-2">2</span> Info</h2>
<div class="outline-text-2" id="text-2">
<p>
Convert DICOM to NIFTI (BIDS). With or w/o defacing.
Provide basic info based on DICOM data.
</p>

<p>
By default DICOM data is expected to reside in directories structured like:
</p>
<ul class="org-ul">
<li><code>./dicom/sub-*/ses-*/s*/</code></li>
</ul>
<p>
The directory for the output defaults to:
</p>
<ul class="org-ul">
<li><code>./nifti/</code></li>
</ul>
</div>
</div>

<div id="outline-container-org7b4ec12" class="outline-2">
<h2 id="org7b4ec12"><span class="section-number-2">3</span> Dependencies</h2>
<div class="outline-text-2" id="text-3">
<p>
Dependencies include:
</p>
<ul class="org-ul">
<li><code>pydicom</code></li>
<li><code>pandas</code></li>
<li><code>tabulate</code></li>
<li><code>pprint</code></li>
<li><code>argparse</code></li>
<li><code>colorama</code></li>
<li><code>datetime</code></li>
<li><code>glob</code></li>
<li><code>sys</code></li>
<li><code>os</code></li>
<li><code>re</code></li>
<li><code>subprocess</code></li>
<li><code>socket</code></li>
</ul>

<p>
Conversion dependencies:
</p>
<ul class="org-ul">
<li><code>pydeface</code></li>
<li><code>dcm2bids</code></li>
</ul>
</div>
</div>
