README.org
* Help

  #+BEGIN_EXAMPLE

usage: cc-dcm2bids-wrapper.py [-O PATH] [-D DIRECTORY] [-N DIRECTORY]
                                      [-p] [-P PATTERN] [-e] [-E PATTERN] [-s]
                                      [-S PATTERN] [-f]
                                      [-F PATTERN [PATTERN ...]] [-l]
                                      [-L FILE] [-t] [-w] [-W FILE] [-k] [-i]
                                      [-m] [-r] [-c] [-C] [-J FILE] [-n] [-g]
                                      [-b] [-q] [-v] [-d] [--version] [-h]

cc-dcm2bids-wrapper.py:
 - explore DICOM directories,
 - display summaries for the data discovered,
 - optionally convert to NIFTI (BIDS) data format.

Tested on GE Discovery 750 MR scanner.

cc-dcm2bids-wrapper.py is free software licensed under GPL 3.0.  Assembled from
various code snippets found on the web by Jan Nikadon (nikadon <at>
gmail <dot> com).



optional arguments:
  -O PATH, --origin PATH
                        Start directory, e.g.,
                        /home/username/study/dicom. The default is
                        <current directory> e.g.,
                        /home/cybercraft/cc/dev/mri/cc-custom-dcm-
                        tools
  -D DIRECTORY, --dicom-dir DIRECTORY
                        DICOM (source) directory. The default is
                        dicom
  -N DIRECTORY, --nifti-dir DIRECTORY
                        NIFTI (target) directory. The default is
                        nifti
  -p, --show-patients   Display patients (subjects) discovered.
  -P PATTERN, --patients PATTERN
                        Unix-like pattern that matches patient (subject)
                        directories, e.g., p* or
                        group-*/sub-*. The default is sub-*
  -e, --show-exams      Display exams (sessions) discovered.
  -E PATTERN, --exams PATTERN
                        Unix-like pattern that matches exam (session)
                        directories, e.g., e*. The default is
                        ses-*
  -s, --show-series     Display series (sequences) discovered.
  -S PATTERN, --series PATTERN
                        Unix-like pattern that matches series (sequence)
                        directories, e.g., s* (which also is the
                        default).
  -f, --show-files      Display DICOM files discovered.
  -F PATTERN [PATTERN ...], --files PATTERN [PATTERN ...]
                        Unix-like pattern that matches DICOM files, e.g.,
                        '*'. Multiple patterns are accepted. The
                        default is 'i*MRDC*' 'i*SCPT*'.
  -l, --log             Save log to file.
  -L FILE, --log-file FILE
                        Log output filename. The default is based on filename
                        executed, hostname, date and time, i.e.,
                        z---<executable-
                        filename>---<hostname>---<YYYYmmdd-HH-MM-SS-
                        sss>---log.org e.g., z---cc-dcm2bids-
                        wrapper.py---false---20180824-180437-768---
                        log.org.
  -t, --table           Produce detailed table on DICOM files found. The
                        default is False.
  -w, --write-csv       Write DICOM information to CSV file. Implies
                        -r.
  -W FILE, --write-csv-file FILE
                        File name for DICOM information to CSV. The default is
                        basename oflog-file with '.csv' extension.
  -k, --keep-sequence-information
                        Keep series information in the table. The default is
                        False
  -i, --include-stacked-screen-saves
                        Include series containing stacked screen saves in the
                        table. The default is False
  -m, --more-info       Display more information derrived from DICOM files.
  -r, --report-files    Display slice timing related information. Implies
                        -tkm.
  -c, --convert-demo    Show commands used to convert discovered series
                        (sequences) from DICOM to NIFTI format. The default is
                        False.
  -C, --convert         Convert discovered series (sequences) from DICOM to
                        NIFTI format. The default is False. Implies
                        -c.
  -J FILE, --study-specific-json FILE
                        Study specific JSON file dontaining series description
                        e.g., study-specific.json. If none provided
                        session-specific JSON file(s) are expected to be
                        located in <current directory> with names
                        corresponding to session(s) E.g.,
                        ses-01pre.json, ses-02post.json ETC.
  -n, --no-defaceing    Turn off defacing during conversion. The default is
                        False
  -g, --GE              Same as -P "p*" -E "e*" -S "s*"  (patterns
                        tailored to raw data obtained from GE MR750 scanner
                        running DV 2.4)
  -b, --BIDS            Same as -P "sub-*" -E "ses-*" -S "*"
                        (patterns tailored to BIDS data structure)
  -q, --quiet           Be (quite) quiet.
  -v, --verbose         Verbose (use multiple times to increase verbbosity up
                        to -vvvv).
  -d, --debug           Debug mode (use multiple times to increase debugging
                        level up to -ddd).
  --version             show program's version number and exit
  -h, --help            Show this help message and exit

Examples:

cc-dcm2bids-wrapper.py --help
cc-dcm2bids-wrapper.py -dm -pes -lrw -cn
cc-dcm2bids-wrapper.py -pes
cc-dcm2bids-wrapper.py -lr

  #+END_EXAMPLE

* Example of functional sequences inspection (GE MR750)
** Overview
*** Code

    #+BEGIN_SRC sh

cc-dcm2bids.py -pes -v -tkim -E "ses-*fmriGeometry"  -lw

    #+END_SRC

*** Info
    - O: =/home/cybercraft/cc/dat/varia/2018/q03/agar-testing-settings=
    - N: =nifti=
    - D: =dicom=
    - P: =sub-*=
    - E: =ses-*fmriGeometry=
    - S: =s*=
    - F: =['i*MRDC*', 'i*SCPT*']=
*** Standard tree
****    dicom/ (1 of 1)
*****   dicom/sub-agar/ (1 of 1)
******  dicom/sub-agar/ses-fmriGeometry/ (1 of 1)
******* dicom/sub-agar/ses-fmriGeometry/s726/ (1 of 13)
******* dicom/sub-agar/ses-fmriGeometry/s734/ (2 of 13)
******* dicom/sub-agar/ses-fmriGeometry/s732/ (3 of 13)
******* dicom/sub-agar/ses-fmriGeometry/s733/ (4 of 13)
******* dicom/sub-agar/ses-fmriGeometry/s725/ (5 of 13)
******* dicom/sub-agar/ses-fmriGeometry/s729/ (6 of 13)
******* dicom/sub-agar/ses-fmriGeometry/s731/ (7 of 13)
******* dicom/sub-agar/ses-fmriGeometry/s723/ (8 of 13)
******* dicom/sub-agar/ses-fmriGeometry/s727/ (9 of 13)
******* dicom/sub-agar/ses-fmriGeometry/s724/ (10 of 13)
******* dicom/sub-agar/ses-fmriGeometry/s722/ (11 of 13)
******* dicom/sub-agar/ses-fmriGeometry/s730/ (12 of 13)
******* dicom/sub-agar/ses-fmriGeometry/s728/ (13 of 13)
