README.html

<div id="outline-container-org50db635" class="outline-2">
<h2 id="org50db635"><span class="section-number-2">4</span> Help</h2>
<div class="outline-text-2" id="text-4">
<pre class="example">

usage: cc-dcm2bids-wrapper.py [-O PATH] [-D DIRECTORY] [-N DIRECTORY]
                                      [-p] [-P PATTERN] [-e] [-E PATTERN] [-s]
                                      [-S PATTERN] [-f]
                                      [-F PATTERN [PATTERN ...]] [-l]
                                      [-L FILE] [-t] [-w] [-W FILE] [-k] [-i]
                                      [-m] [-r] [-c] [-C] [-J FILE] [-n] [-g]
                                      [-b] [-q] [-v] [-d] [--version] [-h]

cc-dcm2bids-wrapper.py:
 - explore DICOM directories,
 - display summaries for the data discovered,
 - optionally convert to NIFTI (BIDS) data format.

Tested on GE Discovery 750 MR scanner.

cc-dcm2bids-wrapper.py is free software licensed under GPL 3.0.  Assembled from
various code snippets found on the web by Jan Nikadon (nikadon &lt;at&gt;
gmail &lt;dot&gt; com).



optional arguments:
  -O PATH, --origin PATH
                        Start directory, e.g.,
                        /home/username/study/dicom. The default is
                        &lt;current directory&gt; e.g.,
                        /home/cybercraft/cc/dev/mri/cc-custom-dcm-
                        tools
  -D DIRECTORY, --dicom-dir DIRECTORY
                        DICOM (source) directory. The default is
                        dicom
  -N DIRECTORY, --nifti-dir DIRECTORY
                        NIFTI (target) directory. The default is
                        nifti
  -p, --show-patients   Display patients (subjects) discovered.
  -P PATTERN, --patients PATTERN
                        Unix-like pattern that matches patient (subject)
                        directories, e.g., p* or
                        group-*/sub-*. The default is sub-*
  -e, --show-exams      Display exams (sessions) discovered.
  -E PATTERN, --exams PATTERN
                        Unix-like pattern that matches exam (session)
                        directories, e.g., e*. The default is
                        ses-*
  -s, --show-series     Display series (sequences) discovered.
  -S PATTERN, --series PATTERN
                        Unix-like pattern that matches series (sequence)
                        directories, e.g., s* (which also is the
                        default).
  -f, --show-files      Display DICOM files discovered.
  -F PATTERN [PATTERN ...], --files PATTERN [PATTERN ...]
                        Unix-like pattern that matches DICOM files, e.g.,
                        '*'. Multiple patterns are accepted. The
                        default is 'i*MRDC*' 'i*SCPT*'.
  -l, --log             Save log to file.
  -L FILE, --log-file FILE
                        Log output filename. The default is based on filename
                        executed, hostname, date and time, i.e.,
                        z---&lt;executable-
                        filename&gt;---&lt;hostname&gt;---&lt;YYYYmmdd-HH-MM-SS-
                        sss&gt;---log.org e.g., z---cc-dcm2bids-
                        wrapper.py---false---20180824-180437-768---
                        log.org.
  -t, --table           Produce detailed table on DICOM files found. The
                        default is False.
  -w, --write-csv       Write DICOM information to CSV file. Implies
                        -r.
  -W FILE, --write-csv-file FILE
                        File name for DICOM information to CSV. The default is
                        basename oflog-file with '.csv' extension.
  -k, --keep-sequence-information
                        Keep series information in the table. The default is
                        False
  -i, --include-stacked-screen-saves
                        Include series containing stacked screen saves in the
                        table. The default is False
  -m, --more-info       Display more information derrived from DICOM files.
  -r, --report-files    Display slice timing related information. Implies
                        -tkm.
  -c, --convert-demo    Show commands used to convert discovered series
                        (sequences) from DICOM to NIFTI format. The default is
                        False.
  -C, --convert         Convert discovered series (sequences) from DICOM to
                        NIFTI format. The default is False. Implies
                        -c.
  -J FILE, --study-specific-json FILE
                        Study specific JSON file dontaining series description
                        e.g., study-specific.json. If none provided
                        session-specific JSON file(s) are expected to be
                        located in &lt;current directory&gt; with names
                        corresponding to session(s) E.g.,
                        ses-01pre.json, ses-02post.json ETC.
  -n, --no-defaceing    Turn off defacing during conversion. The default is
                        False
  -g, --GE              Same as -P "p*" -E "e*" -S "s*"  (patterns
                        tailored to raw data obtained from GE MR750 scanner
                        running DV 2.4)
  -b, --BIDS            Same as -P "sub-*" -E "ses-*" -S "*"
                        (patterns tailored to BIDS data structure)
  -q, --quiet           Be (quite) quiet.
  -v, --verbose         Verbose (use multiple times to increase verbbosity up
                        to -vvvv).
  -d, --debug           Debug mode (use multiple times to increase debugging
                        level up to -ddd).
  --version             show program's version number and exit
  -h, --help            Show this help message and exit

Examples:

cc-dcm2bids-wrapper.py --help
cc-dcm2bids-wrapper.py -dm -pes -lrw -cn
cc-dcm2bids-wrapper.py -pes
cc-dcm2bids-wrapper.py -lr

</pre>
</div>
</div>

<div id="outline-container-orgb26b069" class="outline-2">
<h2 id="orgb26b069"><span class="section-number-2">5</span> Example of functional sequences inspection (GE MR750)</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-orgad85907" class="outline-3">
<h3 id="orgad85907"><span class="section-number-3">5.1</span> Overview</h3>
<div class="outline-text-3" id="text-5-1">
</div>
<div id="outline-container-orgd2d5439" class="outline-4">
<h4 id="orgd2d5439"><span class="section-number-4">5.1.1</span> Code</h4>
<div class="outline-text-4" id="text-5-1-1">
<div class="org-src-container">
<pre class="src src-sh">
cc-dcm2bids.py -pes -v -tkim -E <span style="color: #50a14f;">"ses-*fmriGeometry"</span>  -lw

</pre>
</div>
</div>
</div>

<div id="outline-container-org5c46414" class="outline-4">
<h4 id="org5c46414"><span class="section-number-4">5.1.2</span> Info</h4>
<div class="outline-text-4" id="text-5-1-2">
<ul class="org-ul">
<li>O: <code>/home/cybercraft/cc/dat/varia/2018/q03/agar-testing-settings</code></li>
<li>N: <code>nifti</code></li>
<li>D: <code>dicom</code></li>
<li>P: <code>sub-*</code></li>
<li>E: <code>ses-*fmriGeometry</code></li>
<li>S: <code>s*</code></li>
<li>F: <code>['i*MRDC*', 'i*SCPT*']</code></li>
</ul>
</div>
</div>
<div id="outline-container-orga961d3e" class="outline-4">
<h4 id="orga961d3e"><span class="section-number-4">5.1.3</span> Standard tree</h4>
<div class="outline-text-4" id="text-5-1-3">
</div>
<ol class="org-ol">
<li><a id="org74ef418"></a>dicom/ (1 of 1)<br />
<ol class="org-ol">
<li><a id="org9bdbdb0"></a>dicom/sub-agar/ (1 of 1)<br />
<ol class="org-ol">
<li><a id="orgdedeca9"></a>dicom/sub-agar/ses-fmriGeometry/ (1 of 1)<br />
<ol class="org-ol">
<li><a id="org63471b8"></a>dicom/sub-agar/ses-fmriGeometry/s726/ (1 of 13)<br /></li>
<li><a id="org8ff2945"></a>dicom/sub-agar/ses-fmriGeometry/s734/ (2 of 13)<br /></li>
<li><a id="org42e9dd4"></a>dicom/sub-agar/ses-fmriGeometry/s732/ (3 of 13)<br /></li>
<li><a id="orgb7ad316"></a>dicom/sub-agar/ses-fmriGeometry/s733/ (4 of 13)<br /></li>
<li><a id="orgf9e1bfe"></a>dicom/sub-agar/ses-fmriGeometry/s725/ (5 of 13)<br /></li>
<li><a id="org486ebf9"></a>dicom/sub-agar/ses-fmriGeometry/s729/ (6 of 13)<br /></li>
<li><a id="org48cc43c"></a>dicom/sub-agar/ses-fmriGeometry/s731/ (7 of 13)<br /></li>
<li><a id="org681595f"></a>dicom/sub-agar/ses-fmriGeometry/s723/ (8 of 13)<br /></li>
<li><a id="orgd5d3b99"></a>dicom/sub-agar/ses-fmriGeometry/s727/ (9 of 13)<br /></li>
<li><a id="org30f86f1"></a>dicom/sub-agar/ses-fmriGeometry/s724/ (10 of 13)<br /></li>
<li><a id="orgf7bc52d"></a>dicom/sub-agar/ses-fmriGeometry/s722/ (11 of 13)<br /></li>
<li><a id="org65f7173"></a>dicom/sub-agar/ses-fmriGeometry/s730/ (12 of 13)<br /></li>
<li><a id="orgaa5b466"></a>dicom/sub-agar/ses-fmriGeometry/s728/ (13 of 13)<br /></li>
</ol>
</li>
</ol>
</li>
</ol>
</li>
</ol>
</div>
