README.org
*** Detailed tree
    - dicom [dicom/]
      - agar [dicom/sub-agar/]
        - fmriGeometry [dicom/sub-agar/ses-fmriGeometry/]
          - 726 [dicom/sub-agar/ses-fmriGeometry/s726/]
            - i929583.MRDC.2525 [dicom/sub-agar/ses-fmriGeometry/s726/i929583.MRDC.2525]
          - 734 [dicom/sub-agar/ses-fmriGeometry/s734/]
            - i950479.MRDC.2312 [dicom/sub-agar/ses-fmriGeometry/s734/i950479.MRDC.2312]
          - 732 [dicom/sub-agar/ses-fmriGeometry/s732/]
            - i945503.MRDC.2621 [dicom/sub-agar/ses-fmriGeometry/s732/i945503.MRDC.2621]
          - 733 [dicom/sub-agar/ses-fmriGeometry/s733/]
            - i946459.MRDC.932 [dicom/sub-agar/ses-fmriGeometry/s733/i946459.MRDC.932]
          - 725 [dicom/sub-agar/ses-fmriGeometry/s725/]
            - i927042.MRDC.26 [dicom/sub-agar/ses-fmriGeometry/s725/i927042.MRDC.26]
          - 729 [dicom/sub-agar/ses-fmriGeometry/s729/]
            - i937237.MRDC.2270 [dicom/sub-agar/ses-fmriGeometry/s729/i937237.MRDC.2270]
          - 731 [dicom/sub-agar/ses-fmriGeometry/s731/]
            - i941193.MRDC.947 [dicom/sub-agar/ses-fmriGeometry/s731/i941193.MRDC.947]
          - 723 [dicom/sub-agar/ses-fmriGeometry/s723/]
            - i926911.MRDC.111 [dicom/sub-agar/ses-fmriGeometry/s723/i926911.MRDC.111]
          - 727 [dicom/sub-agar/ses-fmriGeometry/s727/]
            - i930490.MRDC.826 [dicom/sub-agar/ses-fmriGeometry/s727/i930490.MRDC.826]
          - 724 [dicom/sub-agar/ses-fmriGeometry/s724/]
            - i926995.MRDC.67 [dicom/sub-agar/ses-fmriGeometry/s724/i926995.MRDC.67]
          - 722 [dicom/sub-agar/ses-fmriGeometry/s722/]
            - i926798.MRDC.1 [dicom/sub-agar/ses-fmriGeometry/s722/i926798.MRDC.1]
          - 730 [dicom/sub-agar/ses-fmriGeometry/s730/]
            - i939072.MRDC.1465 [dicom/sub-agar/ses-fmriGeometry/s730/i939072.MRDC.1465]
          - 728 [dicom/sub-agar/ses-fmriGeometry/s728/]
            - i933002.MRDC.690 [dicom/sub-agar/ses-fmriGeometry/s728/i933002.MRDC.690]
*** Table
  |    | Path                                 | NumFiles | PatientID | SeriesDescription     | SeriesNumber |
  |----+--------------------------------------+----------+-----------+-----------------------+--------------|
  | 10 | dicom/sub-agar/ses-fmriGeometry/s722 |        3 | agar      | 3Plane-Loc-SSFSE-ge   |            1 |
  |  7 | dicom/sub-agar/ses-fmriGeometry/s723 |      128 | agar      | ASSET Cal GE mod OK   |            2 |
  |  9 | dicom/sub-agar/ses-fmriGeometry/s724 |       75 | agar      | 3Plane-Loc-SSFSE-det  |            3 |
  |  4 | dicom/sub-agar/ses-fmriGeometry/s725 |       44 | agar      | Ax_T1_GRE_inPlane_sTD |            4 |
  |  0 | dicom/sub-agar/ses-fmriGeometry/s726 |     2640 | agar      | fMRI_rest_sTD         |            5 |
  |  8 | dicom/sub-agar/ses-fmriGeometry/s727 |     2640 | agar      | fMRI_rest_sTD         |            6 |
  | 12 | dicom/sub-agar/ses-fmriGeometry/s728 |     2640 | agar      | fMRI_rest_sTD         |            7 |
  |  5 | dicom/sub-agar/ses-fmriGeometry/s729 |     2640 | agar      | fMRI_rest_sTD         |            8 |
  | 11 | dicom/sub-agar/ses-fmriGeometry/s730 |     2640 | agar      | fMRI_rest_sTD         |            9 |
  |  6 | dicom/sub-agar/ses-fmriGeometry/s731 |     2640 | agar      | fMRI_rest_sTD         |           10 |
  |  2 | dicom/sub-agar/ses-fmriGeometry/s732 |     2640 | agar      | fMRI_rest_sTD         |           11 |
  |  3 | dicom/sub-agar/ses-fmriGeometry/s733 |     2640 | agar      | fMRI_rest_sTD         |           12 |
  |  1 | dicom/sub-agar/ses-fmriGeometry/s734 |     2640 | agar      | fMRI_rest_sTD         |           13 |

*** fMRI geometry

    #+BEGIN: columnview :hlines 1 :id "dc72ab10-b551-4438-9ed8-85670fcabbaa" :indent t
    | Item          | NUM | ORDER | ACQ         | VIS_T | VIS_B |
    |---------------+-----+-------+-------------+-------+-------|
    | \_    Results |     |       |             |       |       |
    | \_      s06   |   6 | TD    | Sequential  |     1 |    44 |
    | \_      s07   |   7 | BU    | Sequential  |     1 |    44 |
    | \_      s08   |   8 | TD    | Sequential  |    44 |     1 |
    | \_      s09   |   9 | BU    | Sequential  |    44 |     1 |
    | \_      s10   |  10 | TD    | Interleaved |     1 |    44 |
    | \_      s11   |  11 | BU    | Interleaved |     1 |    44 |
    | \_      s12   |  12 | TD    | Interleaved |    44 |     1 |
    | \_      s13   |  13 | BU    | Interleaved |    44 |     1 |
    #+END:

** fMRI geometry
