README.html
<div id="outline-container-orgcf52518" class="outline-4">
<h4 id="orgcf52518"><span class="section-number-4">5.1.4</span> Detailed tree</h4>
<div class="outline-text-4" id="text-5-1-4">
<ul class="org-ul">
<li>dicom [dicom/]
<ul class="org-ul">
<li>agar [dicom/sub-agar/]
<ul class="org-ul">
<li>fmriGeometry [dicom/sub-agar/ses-fmriGeometry/]
<ul class="org-ul">
<li>726 [dicom/sub-agar/ses-fmriGeometry/s726/]
<ul class="org-ul">
<li>i929583.MRDC.2525 [dicom/sub-agar/ses-fmriGeometry/s726/i929583.MRDC.2525]</li>
</ul></li>
<li>734 [dicom/sub-agar/ses-fmriGeometry/s734/]
<ul class="org-ul">
<li>i950479.MRDC.2312 [dicom/sub-agar/ses-fmriGeometry/s734/i950479.MRDC.2312]</li>
</ul></li>
<li>732 [dicom/sub-agar/ses-fmriGeometry/s732/]
<ul class="org-ul">
<li>i945503.MRDC.2621 [dicom/sub-agar/ses-fmriGeometry/s732/i945503.MRDC.2621]</li>
</ul></li>
<li>733 [dicom/sub-agar/ses-fmriGeometry/s733/]
<ul class="org-ul">
<li>i946459.MRDC.932 [dicom/sub-agar/ses-fmriGeometry/s733/i946459.MRDC.932]</li>
</ul></li>
<li>725 [dicom/sub-agar/ses-fmriGeometry/s725/]
<ul class="org-ul">
<li>i927042.MRDC.26 [dicom/sub-agar/ses-fmriGeometry/s725/i927042.MRDC.26]</li>
</ul></li>
<li>729 [dicom/sub-agar/ses-fmriGeometry/s729/]
<ul class="org-ul">
<li>i937237.MRDC.2270 [dicom/sub-agar/ses-fmriGeometry/s729/i937237.MRDC.2270]</li>
</ul></li>
<li>731 [dicom/sub-agar/ses-fmriGeometry/s731/]
<ul class="org-ul">
<li>i941193.MRDC.947 [dicom/sub-agar/ses-fmriGeometry/s731/i941193.MRDC.947]</li>
</ul></li>
<li>723 [dicom/sub-agar/ses-fmriGeometry/s723/]
<ul class="org-ul">
<li>i926911.MRDC.111 [dicom/sub-agar/ses-fmriGeometry/s723/i926911.MRDC.111]</li>
</ul></li>
<li>727 [dicom/sub-agar/ses-fmriGeometry/s727/]
<ul class="org-ul">
<li>i930490.MRDC.826 [dicom/sub-agar/ses-fmriGeometry/s727/i930490.MRDC.826]</li>
</ul></li>
<li>724 [dicom/sub-agar/ses-fmriGeometry/s724/]
<ul class="org-ul">
<li>i926995.MRDC.67 [dicom/sub-agar/ses-fmriGeometry/s724/i926995.MRDC.67]</li>
</ul></li>
<li>722 [dicom/sub-agar/ses-fmriGeometry/s722/]
<ul class="org-ul">
<li>i926798.MRDC.1 [dicom/sub-agar/ses-fmriGeometry/s722/i926798.MRDC.1]</li>
</ul></li>
<li>730 [dicom/sub-agar/ses-fmriGeometry/s730/]
<ul class="org-ul">
<li>i939072.MRDC.1465 [dicom/sub-agar/ses-fmriGeometry/s730/i939072.MRDC.1465]</li>
</ul></li>
<li>728 [dicom/sub-agar/ses-fmriGeometry/s728/]
<ul class="org-ul">
<li>i933002.MRDC.690 [dicom/sub-agar/ses-fmriGeometry/s728/i933002.MRDC.690]</li>
</ul></li>
</ul></li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org61edb0b" class="outline-4">
<h4 id="org61edb0b"><span class="section-number-4">5.1.5</span> Table</h4>
<div class="outline-text-4" id="text-5-1-5">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">&#xa0;</th>
<th scope="col" class="org-left">Path</th>
<th scope="col" class="org-right">NumFiles</th>
<th scope="col" class="org-left">PatientID</th>
<th scope="col" class="org-left">SeriesDescription</th>
<th scope="col" class="org-right">SeriesNumber</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">10</td>
<td class="org-left">dicom/sub-agar/ses-fmriGeometry/s722</td>
<td class="org-right">3</td>
<td class="org-left">agar</td>
<td class="org-left">3Plane-Loc-SSFSE-ge</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-right">7</td>
<td class="org-left">dicom/sub-agar/ses-fmriGeometry/s723</td>
<td class="org-right">128</td>
<td class="org-left">agar</td>
<td class="org-left">ASSET Cal GE mod OK</td>
<td class="org-right">2</td>
</tr>

<tr>
<td class="org-right">9</td>
<td class="org-left">dicom/sub-agar/ses-fmriGeometry/s724</td>
<td class="org-right">75</td>
<td class="org-left">agar</td>
<td class="org-left">3Plane-Loc-SSFSE-det</td>
<td class="org-right">3</td>
</tr>

<tr>
<td class="org-right">4</td>
<td class="org-left">dicom/sub-agar/ses-fmriGeometry/s725</td>
<td class="org-right">44</td>
<td class="org-left">agar</td>
<td class="org-left">Ax<sub>T1</sub><sub>GRE</sub><sub>inPlane</sub><sub>sTD</sub></td>
<td class="org-right">4</td>
</tr>

<tr>
<td class="org-right">0</td>
<td class="org-left">dicom/sub-agar/ses-fmriGeometry/s726</td>
<td class="org-right">2640</td>
<td class="org-left">agar</td>
<td class="org-left">fMRI<sub>rest</sub><sub>sTD</sub></td>
<td class="org-right">5</td>
</tr>

<tr>
<td class="org-right">8</td>
<td class="org-left">dicom/sub-agar/ses-fmriGeometry/s727</td>
<td class="org-right">2640</td>
<td class="org-left">agar</td>
<td class="org-left">fMRI<sub>rest</sub><sub>sTD</sub></td>
<td class="org-right">6</td>
</tr>

<tr>
<td class="org-right">12</td>
<td class="org-left">dicom/sub-agar/ses-fmriGeometry/s728</td>
<td class="org-right">2640</td>
<td class="org-left">agar</td>
<td class="org-left">fMRI<sub>rest</sub><sub>sTD</sub></td>
<td class="org-right">7</td>
</tr>

<tr>
<td class="org-right">5</td>
<td class="org-left">dicom/sub-agar/ses-fmriGeometry/s729</td>
<td class="org-right">2640</td>
<td class="org-left">agar</td>
<td class="org-left">fMRI<sub>rest</sub><sub>sTD</sub></td>
<td class="org-right">8</td>
</tr>

<tr>
<td class="org-right">11</td>
<td class="org-left">dicom/sub-agar/ses-fmriGeometry/s730</td>
<td class="org-right">2640</td>
<td class="org-left">agar</td>
<td class="org-left">fMRI<sub>rest</sub><sub>sTD</sub></td>
<td class="org-right">9</td>
</tr>

<tr>
<td class="org-right">6</td>
<td class="org-left">dicom/sub-agar/ses-fmriGeometry/s731</td>
<td class="org-right">2640</td>
<td class="org-left">agar</td>
<td class="org-left">fMRI<sub>rest</sub><sub>sTD</sub></td>
<td class="org-right">10</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-left">dicom/sub-agar/ses-fmriGeometry/s732</td>
<td class="org-right">2640</td>
<td class="org-left">agar</td>
<td class="org-left">fMRI<sub>rest</sub><sub>sTD</sub></td>
<td class="org-right">11</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-left">dicom/sub-agar/ses-fmriGeometry/s733</td>
<td class="org-right">2640</td>
<td class="org-left">agar</td>
<td class="org-left">fMRI<sub>rest</sub><sub>sTD</sub></td>
<td class="org-right">12</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-left">dicom/sub-agar/ses-fmriGeometry/s734</td>
<td class="org-right">2640</td>
<td class="org-left">agar</td>
<td class="org-left">fMRI<sub>rest</sub><sub>sTD</sub></td>
<td class="org-right">13</td>
</tr>
</tbody>
</table>
</div>
</div>
