README.org
*** Script

    #+BEGIN_SRC sh

cd ~/cc/dat/varia/2018/q03/agar-testing-settings

cc-dcm2bids.py -pes -S "*s727" -tkimr -lw -L "s727-s06.org"
cc-dcm2bids.py -pes -S "*s728" -tkimr -lw -L "s728-s07.org"
cc-dcm2bids.py -pes -S "*s729" -tkimr -lw -L "s729-s08.org"
cc-dcm2bids.py -pes -S "*s730" -tkimr -lw -L "s730-s09.org"
cc-dcm2bids.py -pes -S "*s731" -tkimr -lw -L "s731-s10.org"
cc-dcm2bids.py -pes -S "*s732" -tkimr -lw -L "s732-s11.org"
cc-dcm2bids.py -pes -S "*s733" -tkimr -lw -L "s733-s12.org"
cc-dcm2bids.py -pes -S "*s734" -tkimr -lw -L "s734-s13.org"


head -n 66 s727-s06.org > first_48_slices_s727-s06.org
head -n 66 s728-s07.org > first_48_slices_s728-s07.org
head -n 66 s729-s08.org > first_48_slices_s729-s08.org
head -n 66 s730-s09.org > first_48_slices_s730-s09.org
head -n 66 s731-s10.org > first_48_slices_s731-s10.org
head -n 66 s732-s11.org > first_48_slices_s732-s11.org
head -n 66 s733-s12.org > first_48_slices_s733-s12.org
head -n 66 s734-s13.org > first_48_slices_s734-s13.org

mkdir -p ./org-log-arch/
mv -v ./s7*org ./s7*csv ./org-log-arch/


    #+END_SRC

*** Results
    :PROPERTIES:
    :COLUMNS:  %25ITEM(Item) %NUM %ORDER %ACQ %VIS_T %VIS_B
    :ID:       dc72ab10-b551-4438-9ed8-85670fcabbaa
    :END:
**** s06
     :PROPERTIES:
     :NUM:      6
     :ORDER:    TD
     :ACQ:      Sequential
     :VIS_T:    1
     :VIS_B:    44
     :END:

     #+BEGIN_EXAMPLE
     :NUM:      6
     :ORDER:    TD
     :ACQ:      Sequential
     :VIS_T:    1
     :VIS_B:    44
     #+END_EXAMPLE

 | SeriesNumber | ImagesInAcquisition | InStackPositionNumber | InstanceNumber | SliceLocation | TriggerTime | FloatSlopRTIATimer |
 |--------------+---------------------+-----------------------+----------------+---------------+-------------+--------------------|
 |            6 |                  44 |                     1 |              1 |       64.4789 |             |             0.0023 |
 |            6 |                  44 |                     2 |              2 |       61.2566 |             |                  0 |
 |            6 |                  44 |                     3 |              3 |       58.0344 |             |             0.0932 |
 |            6 |                  44 |                     4 |              4 |       54.8121 |             |             0.1386 |
 |            6 |                  44 |                     5 |              5 |       51.5898 |             |             0.1841 |
 |            6 |                  44 |                     6 |              6 |       48.3675 |             |             0.2295 |
 |            6 |                  44 |                     7 |              7 |       45.1453 |             |              0.275 |
 |            6 |                  44 |                     8 |              8 |        41.923 |             |             0.3204 |
 |            6 |                  44 |                     9 |              9 |       38.7007 |             |             0.3659 |
 |            6 |                  44 |                    10 |             10 |       35.4784 |             |             0.4114 |
 |            6 |                  44 |                    11 |             11 |       32.2562 |             |             0.4568 |
 |            6 |                  44 |                    12 |             12 |       29.0339 |             |             0.5023 |
 |            6 |                  44 |                    13 |             13 |       25.8116 |             |             0.5477 |
 |            6 |                  44 |                    14 |             14 |       22.5893 |             |             0.5932 |
 |            6 |                  44 |                    15 |             15 |       19.3671 |             |             0.6386 |
 |            6 |                  44 |                    16 |             16 |       16.1448 |             |             0.6841 |
 |            6 |                  44 |                    17 |             17 |       12.9225 |             |             0.7295 |
 |            6 |                  44 |                    18 |             18 |       9.70024 |             |              0.775 |
 |            6 |                  44 |                    19 |             19 |       6.47797 |             |             0.8205 |
 |            6 |                  44 |                    20 |             20 |       3.25569 |             |             0.8659 |
 |            6 |                  44 |                    21 |             21 |     0.0334157 |             |             0.9114 |
 |            6 |                  44 |                    22 |             22 |      -3.18886 |             |             0.9568 |
 |            6 |                  44 |                    23 |             23 |      -6.41113 |             |             1.0023 |
 |            6 |                  44 |                    24 |             24 |      -9.63341 |             |             1.0477 |
 |            6 |                  44 |                    25 |             25 |      -12.8557 |             |             1.0932 |
 |            6 |                  44 |                    26 |             26 |       -16.078 |             |             1.1387 |
 |            6 |                  44 |                    27 |             27 |      -19.3002 |             |             1.1841 |
 |            6 |                  44 |                    28 |             28 |      -22.5225 |             |             1.2296 |
 |            6 |                  44 |                    29 |             29 |      -25.7448 |             |              1.275 |
 |            6 |                  44 |                    30 |             30 |      -28.9671 |             |             1.3205 |
 |            6 |                  44 |                    31 |             31 |      -32.1893 |             |             1.3659 |
 |            6 |                  44 |                    32 |             32 |      -35.4116 |             |             1.4114 |
 |            6 |                  44 |                    33 |             33 |      -38.6339 |             |             1.4568 |
 |            6 |                  44 |                    34 |             34 |      -41.8562 |             |             1.5023 |
 |            6 |                  44 |                    35 |             35 |      -45.0784 |             |             1.5477 |
 |            6 |                  44 |                    36 |             36 |      -48.3007 |             |             1.5932 |
 |            6 |                  44 |                    37 |             37 |       -51.523 |             |             1.6386 |
 |            6 |                  44 |                    38 |             38 |      -54.7453 |             |             1.6841 |
 |            6 |                  44 |                    39 |             39 |      -57.9675 |             |             1.7295 |
 |            6 |                  44 |                    40 |             40 |      -61.1898 |             |              1.775 |
 |            6 |                  44 |                    41 |             41 |      -64.4121 |             |             1.8204 |
 |            6 |                  44 |                    42 |             42 |      -67.6344 |             |             1.8659 |
 |            6 |                  44 |                    43 |             43 |      -70.8566 |             |             1.9113 |
 |            6 |                  44 |                    44 |             44 |      -74.0789 |             |             1.9568 |
 |            6 |                  44 |                     1 |             45 |       64.4789 |             |             2.0023 |
 |            6 |                  44 |                     2 |             46 |       61.2566 |             |             2.0477 |
 |            6 |                  44 |                     3 |             47 |       58.0344 |             |             2.0932 |
 |            6 |                  44 |                     4 |             48 |       54.8121 |             |             2.1386 |

