README.html

<div id="outline-container-org68883af" class="outline-4">
<h4 id="org68883af"><span class="section-number-4">5.1.6</span> fMRI geometry</h4>
<div class="outline-text-4" id="text-5-1-6">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Item</th>
<th scope="col" class="org-right">NUM</th>
<th scope="col" class="org-left">ORDER</th>
<th scope="col" class="org-left">ACQ</th>
<th scope="col" class="org-right">VIS<sub>T</sub></th>
<th scope="col" class="org-right">VIS<sub>B</sub></th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">&ensp;&ensp;&ensp;&ensp;Results</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&ensp;&ensp;&ensp;&ensp;&ensp;&ensp;s06</td>
<td class="org-right">6</td>
<td class="org-left">TD</td>
<td class="org-left">Sequential</td>
<td class="org-right">1</td>
<td class="org-right">44</td>
</tr>

<tr>
<td class="org-left">&ensp;&ensp;&ensp;&ensp;&ensp;&ensp;s07</td>
<td class="org-right">7</td>
<td class="org-left">BU</td>
<td class="org-left">Sequential</td>
<td class="org-right">1</td>
<td class="org-right">44</td>
</tr>

<tr>
<td class="org-left">&ensp;&ensp;&ensp;&ensp;&ensp;&ensp;s08</td>
<td class="org-right">8</td>
<td class="org-left">TD</td>
<td class="org-left">Sequential</td>
<td class="org-right">44</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-left">&ensp;&ensp;&ensp;&ensp;&ensp;&ensp;s09</td>
<td class="org-right">9</td>
<td class="org-left">BU</td>
<td class="org-left">Sequential</td>
<td class="org-right">44</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-left">&ensp;&ensp;&ensp;&ensp;&ensp;&ensp;s10</td>
<td class="org-right">10</td>
<td class="org-left">TD</td>
<td class="org-left">Interleaved</td>
<td class="org-right">1</td>
<td class="org-right">44</td>
</tr>

<tr>
<td class="org-left">&ensp;&ensp;&ensp;&ensp;&ensp;&ensp;s11</td>
<td class="org-right">11</td>
<td class="org-left">BU</td>
<td class="org-left">Interleaved</td>
<td class="org-right">1</td>
<td class="org-right">44</td>
</tr>

<tr>
<td class="org-left">&ensp;&ensp;&ensp;&ensp;&ensp;&ensp;s12</td>
<td class="org-right">12</td>
<td class="org-left">TD</td>
<td class="org-left">Interleaved</td>
<td class="org-right">44</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-left">&ensp;&ensp;&ensp;&ensp;&ensp;&ensp;s13</td>
<td class="org-right">13</td>
<td class="org-left">BU</td>
<td class="org-left">Interleaved</td>
<td class="org-right">44</td>
<td class="org-right">1</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-org7d7a9a0" class="outline-3">
<h3 id="org7d7a9a0"><span class="section-number-3">5.2</span> fMRI geometry</h3>
<div class="outline-text-3" id="text-5-2">
</div>
<div id="outline-container-orga299f1f" class="outline-4">
<h4 id="orga299f1f"><span class="section-number-4">5.2.1</span> Script</h4>
<div class="outline-text-4" id="text-5-2-1">
<div class="org-src-container">
<pre class="src src-sh">
<span style="color: #e44649;">cd</span> ~/cc/dat/varia/2018/q03/agar-testing-settings

cc-dcm2bids.py -pes -S <span style="color: #50a14f;">"*s727"</span> -tkimr -lw -L <span style="color: #50a14f;">"s727-s06.org"</span>
cc-dcm2bids.py -pes -S <span style="color: #50a14f;">"*s728"</span> -tkimr -lw -L <span style="color: #50a14f;">"s728-s07.org"</span>
cc-dcm2bids.py -pes -S <span style="color: #50a14f;">"*s729"</span> -tkimr -lw -L <span style="color: #50a14f;">"s729-s08.org"</span>
cc-dcm2bids.py -pes -S <span style="color: #50a14f;">"*s730"</span> -tkimr -lw -L <span style="color: #50a14f;">"s730-s09.org"</span>
cc-dcm2bids.py -pes -S <span style="color: #50a14f;">"*s731"</span> -tkimr -lw -L <span style="color: #50a14f;">"s731-s10.org"</span>
cc-dcm2bids.py -pes -S <span style="color: #50a14f;">"*s732"</span> -tkimr -lw -L <span style="color: #50a14f;">"s732-s11.org"</span>
cc-dcm2bids.py -pes -S <span style="color: #50a14f;">"*s733"</span> -tkimr -lw -L <span style="color: #50a14f;">"s733-s12.org"</span>
cc-dcm2bids.py -pes -S <span style="color: #50a14f;">"*s734"</span> -tkimr -lw -L <span style="color: #50a14f;">"s734-s13.org"</span>


head -n 66 s727-s06.org &gt; first_48_slices_s727-s06.org
head -n 66 s728-s07.org &gt; first_48_slices_s728-s07.org
head -n 66 s729-s08.org &gt; first_48_slices_s729-s08.org
head -n 66 s730-s09.org &gt; first_48_slices_s730-s09.org
head -n 66 s731-s10.org &gt; first_48_slices_s731-s10.org
head -n 66 s732-s11.org &gt; first_48_slices_s732-s11.org
head -n 66 s733-s12.org &gt; first_48_slices_s733-s12.org
head -n 66 s734-s13.org &gt; first_48_slices_s734-s13.org

mkdir -p ./org-log-arch/
mv -v ./s7*org ./s7*csv ./org-log-arch/


</pre>
</div>
</div>
</div>

<div id="outline-container-org8611d0f" class="outline-4">
<h4 id="org8611d0f"><a id="ID-dc72ab10-b551-4438-9ed8-85670fcabbaa"></a><span class="section-number-4">5.2.2</span> Results</h4>
<div class="outline-text-4" id="text-5-2-2">
<pre class="example">
COLUMNS: %25ITEM(Item) %NUM %ORDER %ACQ %VIS_T %VIS_B
ID: dc72ab10-b551-4438-9ed8-85670fcabbaa
</pre>
</div>
<ol class="org-ol">
